[{"userId":1,"id":1,"updateId":111,"date":"Tue Dec 01 2019 11:32:02","title":"Forum Development","body":"When you click on the + button, you create a new Post. The plus button will make this first ever post look significant different than the post/comment created on Post.js. In Post.js page will show the mother Post and all children posts/comments. Clicking on Reply button on either navigation or make the button visible on every post will bring up a form to reply. Clicking on reply button on each post will make you reply directly to that post. Each post should contain a post id, user id, title and a date. The recent topic on main page should display all latest changes posts that are either uploaded for the first time or updated. A way to do this could be something like comparing using Date(). Each update will update the date"},{"userId":1,"id":0.48558973938782724,"updateId":1,"date":"Thu Dec 12 2019 09:41:30 ","title":"Update Forum","body":"Try to optimise the app. There are several places that could be improved. There are also hundreds of places where the naming make no sense and code created new when you can reuse code to save performance. A messy code will lead to harder to debug. Work on that after finishing creating new topic!"},{"userId":1,"id":0.24477794688349652,"updateId":2,"date":"Thu Dec 12 2019 09:42:14 ","title":"Hardcoded ids","body":"I have to find a way to change it so the id are being added incrementally and dynamically"},{"userId":1,"id":0.8424074120955374,"updateId":19,"date":"Thu Dec 12 2019 14:39:23 ","title":"Hello there","body":"Introduction into the world of web programming that everyone should learn these days to make their own website one day."},{"userId":1,"id":0.19083166219315184,"updateId":154,"date":"Thu Dec 12 2019 16:14:58 ","title":"Update Log","body":"-Fixed a bug where topics would duplicate\n-Changed the way how time should be displayed\n"},{"userId":1,"id":0.3856364481735397,"updateId":20,"date":"Thu Dec 12 2019 18:42:25 ","title":"yrdy","body":"yrdy"}]